ИС_СПОРТ_2022/src/Documents/ПротоколОФПСдачаНормативов/ПротоколОФПСдачаНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколОФПСдачаНормативов</name>
  <basedOn>Document.СоревнованиеОФПСдачаНормативов</basedOn>
  <registerRecords>InformationRegister.ДостиженияСпортсменовПоПротоколу</registerRecords>
  <registerRecords>InformationRegister.ИтоговыеРезультатыСоревнованиийОФПСдачаНормативов</registerRecords>
  <registerRecords>AccumulationRegister.РезультатыВыполненияПоказателейИНормативов</registerRecords>
  <registerRecords>InformationRegister.РезультатыПараметровСоревнованиийОФПСдачаНормативов</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СоревнованиеОФПСдачаНормативов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоревнования</name>
    <type>
      <types>EnumRef.ТипыСдачиНормативов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставУчастников</name>
    <attributes>
      <name>УникальныйИдентификаторСтрокиЗаявленногоНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтрокиНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтартовыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Тренер</name>
      <type>
        <types>CatalogRef.Тренеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>25</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатБулево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Баллы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Очки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Попытки</name>
    <attributes>
      <name>УникальныйИдентификаторСтрокиНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПопытки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>25</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатБулево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПопытки</name>
      <type>
        <types>CatalogRef.СостоянияПопыток</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявленныеНормативы</name>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтрокиЗаявленногоНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/ПротоколОФПСдачаНормативов/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"            , ДокументСсылка);
	Запрос.УстановитьПараметр("Дата"              , ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("УчебныйГод"        , ДокументСсылка.УчебныйГод);
	Запрос.УстановитьПараметр("Организация"       , ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("ДокументОснование" , ДокументСсылка.ДокументОснование);
	Запрос.УстановитьПараметр("ВидСпорта"         , ДокументСсылка.ВидСпорта);
	Запрос.УстановитьПараметр("ТипСоревнования"   , ДокументСсылка.ТипСоревнования);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	""ИтоговыеРезультатыСоревнованиийОФПСдачаНормативов"" КАК ИмяРегистра_,
	                |	&Дата КАК Период,
	                |	&УчебныйГод КАК УчебныйГод,
	                |	&Организация КАК Организация,
	                |	&ДокументОснование КАК ДокументОснование,
	                |	&ТипСоревнования КАК ТипСоревнования,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	ПротоколОФП.Спортсмен КАК Спортсмен,
	                |	ПротоколОФП.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	ПротоколОФП.Тренер КАК Тренер,
	                |	ПротоколОФП.Норматив КАК Норматив,
	                |	ПротоколОФП.СтартовыйНомер КАК СтартовыйНомер,
	                |	ПротоколОФП.РезультатЧисло КАК РезультатЧисло,
	                |	ПротоколОФП.РезультатБулево КАК РезультатБулево,
	                |	ПротоколОФП.Место КАК Место
	                |ИЗ
	                |	Документ.ПротоколОФПСдачаНормативов.СоставУчастников КАК ПротоколОФП
	                |ГДЕ
	                |	ПротоколОФП.Ссылка = &Ссылка
	                |	И ПротоколОФП.Норматив <> ЗНАЧЕНИЕ(справочник.нормативы.пустаяссылка)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	""РезультатыВыполненияПоказателейИНормативов"" КАК ИмяРегистра_,
	                |	&Дата КАК Период,
	                |	&УчебныйГод КАК УчебныйГод,
	                |	&Организация КАК Организация,
	                |	&ДокументОснование КАК ДокументОснование,
	                |	&ТипСоревнования КАК ТипСоревнования,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	ПротоколОФП.Спортсмен КАК Спортсмен,
	                |	ПротоколОФП.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	ПротоколОФП.Тренер КАК Тренер,
	                |	ПротоколОФП.Норматив КАК Норматив,
	                |	ПротоколОФП.РезультатЧисло КАК РезультатЧисло,
	                |	ПротоколОФП.РезультатБулево КАК РезультатБулево,
	                |	ПротоколОФП.Место КАК Место,
	                |	ПротоколОФП.Баллы КАК Балл,
	                |	ПротоколОФП.Очки КАК Очки,
	                |	ПротоколОФП.СтартовыйНомер КАК СтартовыйНомер
	                |ИЗ
	                |	Документ.ПротоколОФПСдачаНормативов.СоставУчастников КАК ПротоколОФП
	                |ГДЕ
	                |	ПротоколОФП.Ссылка = &Ссылка
	                |	И ПротоколОФП.Норматив <> ЗНАЧЕНИЕ(справочник.нормативы.пустаяссылка)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	""РезультатыПараметровСоревнованиийОФПСдачаНормативов"" КАК ИмяРегистра_,
	                |	&Дата КАК Период,
	                |	&УчебныйГод КАК УчебныйГод,
	                |	&Организация КАК Организация,
	                |	&ДокументОснование КАК ДокументОснование,
	                |	&ТипСоревнования КАК ТипСоревнования,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	ПротоколОФП.Спортсмен КАК Спортсмен,
	                |	ПротоколОФП.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	ПротоколОФП.Норматив КАК Норматив,
	                |	ПротоколОФП.Тренер КАК Тренер,
	                |	ПротоколОФППопытки.НомерПопытки КАК Параметр,
	                |	ПротоколОФППопытки.РезультатЧисло КАК РезультатЧисло,
	                |	ПротоколОФППопытки.РезультатБулево КАК РезультатБулево,
	                |	ПротоколОФППопытки.СостояниеПопытки КАК СостояниеПопытки
	                |ИЗ
	                |	Документ.ПротоколОФПСдачаНормативов.СоставУчастников КАК ПротоколОФП
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПротоколОФПСдачаНормативов.Попытки КАК ПротоколОФППопытки
	                |		ПО ПротоколОФП.Ссылка = ПротоколОФППопытки.Ссылка
	                |			И ((ВЫРАЗИТЬ(ПротоколОФП.УникальныйИдентификаторСтрокиНорматива КАК СТРОКА(36))) = (ВЫРАЗИТЬ(ПротоколОФППопытки.УникальныйИдентификаторСтрокиНорматива КАК СТРОКА(36))))
	                |ГДЕ
	                |	ПротоколОФП.Ссылка = &Ссылка
	                |	И ПротоколОФППопытки.НомерПопытки <> 0
	                |	И ПротоколОФП.Норматив <> ЗНАЧЕНИЕ(справочник.нормативы.пустаяссылка)";
	
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаИтоговыеРезультатыСоревнованиийОФПСдачаНормативов"          , Пакет[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаРезультатыВыполненияПоказателейИНормативов"                 , Пакет[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаРезультатыПараметровСоревнованиийОФПСдачаНормативов"        , Пакет[2].Выгрузить());
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПротоколОФПСдачаНормативов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПротоколОФПСдачаНормативов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПротоколОФПСдачаНормативов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры
